bmourit/ArduinoCore-GD32/variants/CREALITY_422_GD32F303RE/PeripheralPins.c
const PinMap PinMap_UART_RTS[] = {
	{PORTA_1,       USART1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},        					/* USART1_RTS */
	{PORTA_12,      USART0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                  /* USART0_RTS */
	{PORTB_14,      USART2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                  /* USART2_RTS */
	{PORTB_14,      USART2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, USART2_PARTIAL_REMAP)},        /* USART2_RTS */
	{NC,    NP,    0}
};

const PinMap PinMap_UART_CTS[] = {
	{PORTA_0,       USART1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                  /* USART1_CTS */
	{PORTA_11,      USART0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                  /* USART0_CTS */
	{PORTB_13,      USART2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},   								/* USART2_CTS */
	{PORTB_13,      USART2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, USART2_PARTIAL_REMAP)},        /* USART2_CTS */
	{NC,    NP,    0}
};

/* SPI PinMap */
const PinMap PinMap_SPI_MOSI[] = {
	{PORTA_7,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},            				/* SPI0_MOSI */
	//{PORTB_5,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, SPI0_REMAP)},                  /* SPI0_MOSI */
	{PORTB_5,       SPI2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI2_MOSI */
	{PORTB_15,      SPI1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI1_MOSI */
	{NC,    NP,    0}
};

const PinMap PinMap_SPI_MISO[] = {
	{PORTA_6,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},            				/* SPI0_MISO */
	//{PORTB_4,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, SPI0_REMAP)},                  /* SPI0_MISO */
	{PORTB_4,       SPI2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI2_MISO */
	{PORTB_14,      SPI1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI1_MISO */
	{NC,    NP,    0}
};

const PinMap PinMap_SPI_SCLK[] = {
	{PORTA_5,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},            				/* SPI0_SCLK */
	//{PORTB_3,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, SPI0_REMAP)},                  /* SPI0_SCLK */
	{PORTB_3,       SPI2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI2_SCLK */
	{PORTB_13,      SPI1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI1_SCLK */
	{NC,    NP,    0}
};

const PinMap PinMap_SPI_SSEL[] = {
	{PORTA_4,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},            				/* SPI0_SSEL */
	//{PORTA_15,      SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, SPI0_REMAP)},                  /* SPI0_SSEL */
	{PORTA_15,      SPI2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI2_SSEL */
	{PORTB_12,      SPI1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI1_SSEL */
	{NC,    NP,    0}
};

/* CAN PinMap */
const PinMap PinMap_CAN_RD[] = {
	{PORTA_11, CAN0, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_FLOATING, REMAP_NONE)},                   /* CAN_RD */
	{PORTB_8,  CAN0, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_FLOATING, CAN_FULL_REMAP)},               /* CAN_RD */
	{NC,    NP,    0}
};

const PinMap PinMap_CAN_TD[] = {
	{PORTA_12, CAN0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_FLOATING, REMAP_NONE)},                   /* CAN0_TD */
	{PORTB_9,  CAN0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_FLOATING, CAN_FULL_REMAP)},               /* CAN0_TD */
	{NC,    NP,    0}
};

//const PinMap PinMap_USB[] = {
//  {PORTA_11, USB, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_FLOATING, REMAP_NONE)}, 										/* USB_DM */
//  {PORTA_12, USB, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_FLOATING, REMAP_NONE)}, 										/* USB_DP */
//  {NC,    NP,    0}
//};

const PinMap PinMap_SD[] = {
  {PORTB_8,  SDIO, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},													/* SDIO_D4 */
  {PORTB_9,  SDIO, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                         /* SDIO_D5 */
  {PORTC_6,  SDIO, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                         /* SDIO_D6 */
  {PORTC_7,  SDIO, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                         /* SDIO_D7 */
  {PORTC_8,  SDIO, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                         /* SDIO_D0 */
  {PORTC_9,  SDIO, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                         /* SDIO_D1 */
  {PORTC_10, SDIO, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                         /* SDIO_D2 */
  {PORTC_11, SDIO, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                         /* SDIO_D3 */
  {PORTC_12, SDIO, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_FLOATING, REMAP_NONE)},                   /* SDIO_CK */
  {PORTD_2,  SDIO, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_FLOATING, REMAP_NONE)},                   /* SDIO_CMD */
  {NC,    NP,    0}
};
